## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 48 to change, 8 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;jui-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;adoption&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;child-adoption&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-amend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-da&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-dn&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-pfe&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-rfe&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-response-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-staff-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-sya&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fact&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fact-admin&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fees-register&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hwf-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hwf-staff-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ia-aip&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-user-dashboard&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-web-admin&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;lau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;manage-payments&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;nfdiv-civil-partnership&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ocmc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;paybubble&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;payment-outcome&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pcq&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;plum&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;private-law&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;probate&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;reformscan&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;return-case-doc-ccd&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sptribs-frontend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-cor&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-tribunals&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-tya&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;tt-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-approve-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-manage-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-register-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-webapp&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;jui-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;cmc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "0001-01-01T00:00:00.0000000" -> (known after apply)
      ~ host_name                = "www.moneyclaims.service.gov.uk" -> "www1.moneyclaims.service.gov.uk" # forces replacement
      ~ id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc" -> (known after apply)
        name                     = "cmc"
      + validation_token         = (known after apply)
        # (1 unchanged attribute hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/4db27b97-a5d3-4ef3-8f8a-140110d6358c-www-moneyclaims-service-gov-uk" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["fact-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/fact-redirect"
        name                     = "fact-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/factredirect-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["idam-web-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/idam-web-public"
        name                     = "idam-web-public"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["jui-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/jui-redirect"
        name                     = "jui-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/associations/cmc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/associations/cmc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/cmc/origins/cmc"
        name                           = "cmc"
      ~ origin_host_header             = "www.moneyclaims.service.gov.uk" -> "www1.moneyclaims.service.gov.uk"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc",
        ] -> (known after apply)
        id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod/routes/cmc"
        name                            = "cmc"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc",
        ] -> (known after apply)
        id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod/routes/cmcHttpsRedirect"
        name                            = "cmcHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["fact-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/factredirect-managed-secret" -> (known after apply)
        name                       = "factredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk/f433ceffeaaa4a43a89e3ec7fcae055e" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk/a3ce2faa04b94e2f8ed516754118e602" # forces replacement
              ~ subject_alternative_names = [
                  - "courttribunalfinder.service.gov.uk",
                  - "www.courttribunalfinder.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["idam-web-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
        name                       = "idamwebpublic-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk/f4d8c10d107e40fea99bb8a0ba8088f6" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk/c25b95a04a85497f8ed43ac324aabd84" # forces replacement
              ~ subject_alternative_names = [
                  - "hmcts-access.service.gov.uk",
                  - "idam-web-public.platform.hmcts.net",
                  - "idam.platform.hmcts.net",
                  - "www.idam.platform.hmcts.net",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["jui-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
        name                       = "juiredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk/cb6dd553b92140aabf2d6baadb4a3735" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk/96ba7d92c67b459dab727e5fe142326e" # forces replacement
              ~ subject_alternative_names = [
                  - "jcm.judiciary.uk",
                  - "www.jcm.judiciary.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/securityPolicies/cmcprodPremium-securityPolicy" -> (known after apply)
        name                     = "cmcprodPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/cmc" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.apply-for-adoption"
        name                = "_dnsauth.apply-for-adoption"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["child-adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-to-adopt-a-child-placed-in-your-care.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "6l0bcbmv2w2msgb9bhsgsz6gwpchgdhh" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["cmc"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.www.moneyclaims.service.gov.uk." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/moneyclaims.service.gov.uk/TXT/_dnsauth.www" -> (known after apply)
      ~ name                = "_dnsauth.www" -> "_dnsauth.www1" # forces replacement
      - tags                = {} -> null
      ~ ttl                 = 300 -> 3600
        # (2 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-amend"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.manage-application"
        name                = "_dnsauth.www.manage-application"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-da"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.decree-absolute"
        name                = "_dnsauth.www.decree-absolute"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-dn"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.decree-nisi"
        name                = "_dnsauth.www.decree-nisi"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-rfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/respond-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "n7jggxh4nxk0bw4h7gwkkfczcgnyr8pf" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-response-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.tribunal-response"
        name                = "_dnsauth.tribunal-response"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "m1t4z891j5zxph4hm7sfz49d074mggm0" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "68ql3qng3jth214vgxkrznznlhdp4rkt" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-sya"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/claim-employment-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fact"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/find-court-tribunal.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fact-admin"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/find-court-tribunal.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fees-register"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.fees-register"
        name                = "_dnsauth.fees-register"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hwf-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "nhxqv5qnxsf225spck3frjmmh7pgrdp5" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hwf-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth.staff"
        name                = "_dnsauth.staff"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "bs30d0zt8wy3hkn44nktj9j5pm5y972q" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ia-aip"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-immigration-asylum-decision.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.idam-user-dashboard"
        name                = "_dnsauth.idam-user-dashboard"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.idam-web-admin"
        name                = "_dnsauth.idam-web-admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-web-public"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts-access.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["lau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.log-and-audit"
        name                = "_dnsauth.log-and-audit"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["manage-payments"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-payments"
        name                = "_dnsauth.manage-payments"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["nfdiv-civil-partnership"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/end-civil-partnership.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ocmc"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/moneyclaims.service.gov.uk/TXT/_dnsauth.www1"
        name                = "_dnsauth.www1"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "8lck4v7jp0fj6404znjbss7zxctm18tm" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["paybubble"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.paybubble"
        name                = "_dnsauth.paybubble"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["payment-outcome"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.paymentoutcome-web"
        name                = "_dnsauth.paymentoutcome-web"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pcq"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.equality-and-diversity"
        name                = "_dnsauth.equality-and-diversity"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["plum"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.plum"
        name                = "_dnsauth.plum"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["private-law"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["probate"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-for-probate.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["reformscan"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.reformscan"
        name                = "_dnsauth.reformscan"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["return-case-doc-ccd"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.return-case-doc.ccd"
        name                = "_dnsauth.return-case-doc.ccd"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sptribs-frontend"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/special-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-cor"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk/TXT/_dnsauth.www.manage"
        name                = "_dnsauth.www.manage"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-tribunals"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-tya"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/track-benefit-appeal.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["tt-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-tax-tribunal.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "wtd9npx6z8s48v0vqt02bqbrq4c206k1" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-approve-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.administer-orgs"
        name                = "_dnsauth.administer-orgs"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-manage-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-org"
        name                = "_dnsauth.manage-org"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-register-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.register-org"
        name                = "_dnsauth.register-org"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-webapp"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-case"
        name                = "_dnsauth.manage-case"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 48 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1891,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->